Tekla Open API Reference for Tekla Structures 2025
Face Methods
The Face type exposes the following members.
Methods
Name | Description
GetLoopEnumerator
 Gets a new loop enumerator for enumerating through the face's loops.
Top
See Also
Reference
Face Class
Tekla.Structures.Solid Namespace